{
  "WorkshopId": 3302350080,
  "Title": "Zone Loot List",
  "Description": "[h2]I pick things up and put them down.[/h2]\r\n\r\n[b]This mod adds a couple popups to the game that lets you quickly pick up loot after clearing a zone (but only items that you have seen), or helps pick items to drop if your inventory is getting full.[/b]\r\n\r\n[h3]Zone Loot List[/h3]\r\nThis is a list of all items in an area. Any items that you haven't already seen are hidden from the list, to avoid feeling cheaty. In multi-pickup mode, you may select any number of items and autoexplore to pick them up. In single-pickup mode, you will travel to an adjacent tile instead of marking an item for pickup. Liquid pools are optionally shown in the list, but they will travel to an adjacent tile regardless of the current pickup mode.\r\n\r\nNote: I may not be held liable for any damage that is caused by autotraveling through adverse tiles.\r\n\r\n[h3]Item Knowledge[/h3]\r\nThe item lists can be sorted by weight or by value/weight ratio. In order to keep things realistic, the value of items will not be known by default. You will have to [i]learn[/i] the value of items through a few different ways:\r\n[list]\r\n[*] A merchant tells you the price.\r\n  [list]\r\n  [*] Visit a merchant with the item in your inventory.\r\n  [*] Your character will also remember item prices it sees in a merchant's wares.\r\n  [/list]\r\n[*] Become skilled in appraisal.\r\n  [list]\r\n  [*] This mod includes a skill in the Customs and Folklore category. 50sp and 19 int required.\r\n  [*] Mercantility skill from [url=https://steamcommunity.com/sharedfiles/filedetails/?id=3024356897]GammaDelta's Appraisal[/url] mod is also accepted if you have trained it.\r\n  [/list]\r\n[*] Cheat.\r\n[list][*] There's a game option that will always show the value ratio of an item regardless of earned knowledge.[/list]\r\n[/list]\r\n\r\nWhen the item list window is set to search on Value, it won't tell you the exact numeric value/weight ratio, but it will give you an idea of the relative ratio:\r\n[list]\r\n[*] [b][u]red[/u] ($)[/b]: sells for less than it weighs (less than 1 dram/pound)\r\n[*] [b][u]yellow[/u] ($)[/b]: less weight/value than water (less than 4 drams/pound)\r\n[*] [b][u]green[/u] ($$)[/b]: greater than water (more dollar signs means more valuable)\r\n[*] [b][u]tan[/u] (##)[/b]: value is unknown - weight is listed instead\r\n[*] [b][u]blue[/u] ($$$)[/b]: weight is zero, value ratio is unlimited\r\n[*] [b][u]dark grey[/u] (X)[/b]: not sellable (usually for fresh water containers)\r\n[/list]\r\n\r\nItems closer to the top of either list are generally more desirable to pick up or put down. This is not guaranteed though, so make sure you double check before selecting items.\r\n\r\n[hr]\r\n[h3]Keybinds[/h3]\r\n[*] [b][u]Show Inventory/Zone Loot[/u][/b]: Show a sortable list of all items in your inventory or known items in the zone.\r\n[*] [b][u]Uninstall Mod[/u][/b]: Prepares the game files for the mod to be removed. This is not strictly necessary but it will prevent an error from showing if you try to load a game after disabling the mod.\r\n[*] [b][u]Inv: Sort Items[/u][/b]: Toggle sorting items by weight or value/weight ratio for inventory list.\r\n[*] [b][u]Inv: Drop Items[/u][/b]: Confirm drop selected items in the inventory list.\r\n[*] [b][u]Zone: Sort Items[/u][/b]: Toggle sorting items by weight or value/weight ratio for zone loot list.\r\n[*] [b][u]Zone: Select All[/u][/b]: Toggle Select/Deselect all items in the zone loot list.\r\n[*] [b][u]Zone: Pickup Mode[/u][/b]: Switch between multi-select and single-select mode.\r\n[/list]\r\n\r\n[h3]Options[/h3]\r\n[list]\r\n[*] [b][u]Trash/Corpses/Boulders in Zone Loot[/u][/b]: Filter trash, corpses, and/or boulders from the Zone Loot List.\r\n[*] [b][u]Liquids in Zone Loot[/u][/b]: Show and traverse to liquid pools and vessels in Zone Loot List.\r\n[*] [b][u]Chests in Zone Loot[/u][/b]: Show items in chests and reset autoexplore status to reopen them.\r\n[*] [b][u]Use Activated Ability[/u][/b]: Add a player ability to show the popups. Useful if you don't have enough spare keys to keybind.\r\n[*] [b][u]Preferred Sort/Pickup Mode[/u][/b]: Opens the popups with one of these sort or pickup options by default. Previously used sort option is saved per run, so this option only dictates the first time the list is opened in your run.\r\n[*] [b][u]Omnicient[/u][/b]: This will make it so you are knowledgeable in all item sell values without needing to buy the skill or learn the price from a merchant.\r\n[/list]\r\n\r\n[h3]Notes[/h3]\r\nThis mod is safe to install or uninstall at any point in your run. There is an uninstall keybind that will clean up your save file but it's not strictly necessary. If you unsubscribe without using that keybind, you will get an error the next time you load your game, but the game will work perfectly fine and it will not error after that. If you wish to see the source code for this mod, you can find it on my [url=https://github.com/plaidman/qud-mods]github page[/url].\r\n\r\n[h3]Thanks[/h3]\r\n[list]\r\n[*] [b]GammaDelta[/b] and [b]KarateSnoopy[/b] whose mods offered direct inspiration to the features of this mod.\r\n[*] [b]books[/b], [b]kernel[/b], [b]Sol[/b] and other helpful and patient modders in the discord.\r\n[*] Many other devs who have shared their code through their mods, which I have referenced while making this mod.\r\n[*] Of course the Qud devs for making a great game and opened it up to modding.\r\n[/list]",
  "Tags": "UI,UX,Script,Inventory,Skill,An Eye For Value,Lighten My Load",
  "Visibility": "2",
  "ImagePath": "preview.png"
}