{
  "WorkshopId": 3287770072,
  "Title": "Colors of Qud [Fork]",
  "Description": "This is an exact copy of the [url=https://steamcommunity.com/sharedfiles/filedetails/?id=2811969951]original Colors of Qud mod[/url], except I have fixed the lines listed in the original mod's comments, and one additional fix that went unnoticed. I have no idea if the altered items have changed in a way that might break this mod. Hopefully not. Anyway, this was forked without permission, and released to make it easier for others to download the mod with fixes. All credit goes to the original author.\r\n\r\n[hr][/hr] \r\nA simple mod that adds a splash of color to normally statically-hued objects, and reveals a few normally hidden secondary colors of tiles.\r\n\r\nItems with rainbow-randomized parts:\r\nWalking sticks, crayon boxes, clay pots, gourds, staves, wide brimmed hats, teleprojectors, spectacles, beds, cribs, four-poster beds, floor cushions, stools, hookahs, breadboards, and cloth robes.\r\n\r\nItems with randomization within a specific color palette:\r\nMoon masks, sun and moon masks, wool kilts, rainboweave cloaks, chiral rings, scrapasans, globes, sewing machines, patchwork coats, scarlet shawls, quilted shawls, snapjaw scavenger capes, bookshelves, alchemist tables, equimaxes, and salamanders.\r\n\r\nColor-corrected items, and things with their secondary color now visible:\r\nWorn burnooses, electrobows, iron gates, iron fences, boars, grandfather horns, goats, bears, barkbiters, mimics, rimewyks, mechanimist catechists, pigs, ghost perch, bloated pearlfrogs, amber-tipped staves, snapjaw shotgunners, cave spiders, desert krises, food cubes, and blood-stained neckrings.\r\n\r\nMisc:\r\nStiltground tent signs, grenades, and barathrumites are uniquely colored. Kilndled flame has added flaming effects. Dragonfly wings flicker.\r\n\r\n(This is baby's first mod, and very easily editable. Feel free to yoink any of this mods content for use in your own projects. Comments, criticism, and suggestions welcome via pms, comments, or through discord.)",
  "Tags": "Cosmetic",
  "Visibility": "2",
  "ImagePath": "preview.png"
}