{
  "WorkshopId": 3321160287,
  "Title": "Salt Shuffle Revival",
  "Description": "[h1]A collectible card game? In MY traditional roguelike??[/h1]\r\n\r\nYes! This is the revival of the premier [url=https://steamcommunity.com/sharedfiles/filedetails/?id=1796067936]CCG minigame[/url] from the great mind of Nalathni. So unwrap your starter deck and jump into the newly revived collectible card game craze that's re-sweeping Qud! Everyone's playing it! (Seriously, Ctesiphus will still kick your butt at cards.)\r\n\r\n[hr]\r\n[h3]Notes[/h3]\r\nThis mod is safe to install at any point in your run, and should work with mods that edit/add factions or add new creatures. New game characters will receive a starter pack which can be opened to receive 12 cards. If you install this mod in the middle of a run, you will have to find booster packs around the world, or you can wish for [u]ssr starter[/u] to create a new starter pack.\r\n\r\nIf you want to uninstall the mod, you can use the keybind. That will remove all SSR items from your inventory and prevent any errors from showing the next time you start the game. If you uninstall the mod without the keybind, you will get an error the next time you load your game, but the game will work perfectly fine and it will not error after that, however the cards in your inventory will be inert and will still not work even if you reinstall the mod.\r\n\r\nIf you wish to see the source code for this mod, you can find it on my [url=https://github.com/plaidman/qud-mods]github page[/url].\r\n\r\n[h3]Thanks[/h3]\r\n[list]\r\n[*] [b]Nalathni[/b] for the original code and game mechanics for this crazy cool mod.\r\n[*] [b]books[/b], [b]Sol[/b] and other helpful and patient modders in the discord.\r\n[*] Many other devs who have shared their code through their mods, which I have referenced while making this mod.\r\n[*] Of course the Qud devs for making a great game and opened it up to modding.\r\n[/list]",
  "Tags": "Script,Conversation,Card Game,Collectible,Minigame",
  "Visibility": "2",
  "ImagePath": "preview.png"
}