{
  "WorkshopId": 3298826028,
  "Title": "Lighten My Load",
  "Description": "Consider this mod to be the companion app to my other mod [url=https://steamcommunity.com/sharedfiles/filedetails/?id=3291913360]Zone Loot List[/url]. That mod helps you pick stuff up, and this one helps you put stuff down.\r\n\r\nAt the simple press of a button, you will be shown a list of all your inventory items, and allowed to pick any items you wish to drop. You can sort the list by weight, and also by value/weight ratio. In order to not make things too easy, the value of items will not be \"known\" by default. You will have to learn the value of items as you play the game through several methods:\r\n[list]\r\n[*] A merchant tells you the price.\r\n[list][*] Visit a merchant with the item in either of your inventories.[/list]\r\n[*] Become skilled in appraisal.\r\n  [list]\r\n  [*] This mod includes a skill in the Customs and Folklore category. 50sp and 19 int required.\r\n  [*] Mercantility skill from [url=https://steamcommunity.com/sharedfiles/filedetails/?id=3024356897]GammaDelta's Appraisal[/url] mod is also accepted since it seems to work with the current version of Qud.\r\n  [/list]\r\n[*] Cheat.\r\n[list][*] There's a game option that will always show the value ratio of an item regardless of earned knowledge.[/list]\r\n[/list]\r\n\r\nWhen the item list window is set to search on Value, it won't tell you the exact numeric value/weight ratio, but it will give you an idea of the relative ratio:\r\n[list]\r\n[*] [b][u]red[/u] ($)[/b]: sells for less than it weighs (less than 1 dram/pound)\r\n[*] [b][u]yellow[/u] ($)[/b]: less weight/value than water (less than 4 drams/pound)\r\n[*] [b][u]green[/u] ($$)[/b]: greater than water (more dollar signs means more valuable)\r\n[*] [b][u]tan[/u] (##)[/b]: value is unknown - weight is listed instead\r\n[*] [b][u]blue[/u] (0#)[/b]: weight is zero, value ratio is unlimited\r\n[*] [b][u]dark grey[/u] (X)[/b]: not sellable (usually for water containers)\r\n[/list]\r\n\r\nItems closer to the top of the list are generally lower value or higher weight, and may be more desirable to drop to make room for other items. This is not guaranteed though, so make sure you double check before dropping items.\r\n\r\n[hr]\r\n[h3]Keybinds[/h3]\r\n[*] [b][u]Show Item List[/u][/b]: Show a sortable list of all items in your inventory.\r\n[*] [b][u]Uninstall Mod[/u][/b]: Prepares the game files for the mod to be removed. This is not strictly necessary but it will prevent an error from showing if you try to load a game after disabling the mod.\r\n[/list]\r\n\r\n[h3]Options[/h3]\r\n[list]\r\n[*] [b][u]Use Activated Ability[/u][/b]: Add a player ability to show the item list. Useful if you don't have enough spare keys to keybind.\r\n[*] [b][u]Preferred Sort Mode[/u][/b]: Opens the menu with one of these sort options by default. Previously used sort option is saved per run, so this option dictates the first time the list is opened in your run.\r\n[*] [b][u]Always Show Value[/u][/b]: This will force the inventory list to always show the value/weight ratio instead of requiring you to learn that information through gameplay.\r\n[/list]\r\n\r\n[h3]Notes[/h3]\r\nThis mod is safe to install or uninstall at any point in your run. There is an uninstall keybind that will clean up your save file but it's not strictly necessary. If you unsubscribe without using that keybind, you will get an error the next time you load your game, but the game will work perfectly fine and it will not error after that. If you wish to see the source code for this mod, you can find it on my [url=https://github.com/plaidman/lighten-my-load]github page[/url].\r\n\r\n[h3]Thanks[/h3]\r\n[list]\r\n[*] [b]GammaDelta[/b] (Appraisal) who inspired the idea to have the item values be learned, and whose code I referenced to add new skills.\r\n[*] [b]books[/b], [b]kernel[/b] and other helpful and patient modders in the discord.\r\n[*] Of course the Qud devs for making a great game and opened it up to modding.\r\n[/list]",
  "Tags": "UX,Script,Skill,Inventory",
  "Visibility": "2",
  "ImagePath": "preview.png"
}