{
  "WorkshopId": 3312620817,
  "Title": "Recoverable Arrows",
  "Description": "[h1]Arrows sometimes don't break![/h1]\r\n\r\nOne of the main complaints with using Bows is the lack of arrows to back them up. This mod makes it so arrows have a good chance to not break when fired. If you miss your target, you can pick up your unbroken arrows and reuse them at any time. To recover any arrows that find their way into creatures' hides, you'll have to wait until they're not moving any more (i.e. dead) before you can pull them out. Higher level arrows have a higher chance to remain intact.\r\n\r\nThis mod was heavily inspired by [url=https://steamcommunity.com/sharedfiles/filedetails/?id=2294964593]Arrow Recovery[/url] by CatlikeSpectator. Many improvements were made including:\r\n[list]\r\n[*] More immersive behavior when shooting creatures.\r\n[*] Arrows that fly off into the distance are not guaranteed losses.\r\n[*] Arrows that hit walls no longer need the wall to be destroyed to recover them.\r\n[*] Optional verbose messages in the combat log.\r\n[*] Simple integration with modded arrows.\r\n[/list]\r\n\r\n[h3]Mod Compatibility[/h3]\r\nMaking your mod compatible with Recoverable Arrows is pretty simple:\r\n[list]\r\n[*] Your Ammo blueprint should be 1:1 to your Projectile blueprint. In other words, don't reuse an existing Projectile blueprint in your AmmoArrow part. Inheriting from an existing Projectile blueprint is fine.\r\n[*] Your Projectile blueprint should be a descendant of TemporaryProjectile and include an <intproperty Name=\"RA_BreakChance\" Value=\"50\" /> where the value is the percentage chance for the arrow to break.\r\n[/list]\r\nThat's it! If you exclude the intproperty on a Projectile, arrows will always break (good for things like boomrose). If the player is missing this mod, the intproperty will be inert and throw no errors.\r\n\r\n[hr]\r\n[h3]Keybinds[/h3]\r\n[*] [b][u]Uninstall Mod[/u][/b]: Prepares the game files for the mod to be removed. This is not strictly necessary but it will prevent an error from showing if you try to load a game after disabling the mod.\r\n[/list]\r\n\r\n[h3]Options[/h3]\r\n[list]\r\n[*] [b][u]Verbose Logs[/u][/b]: Show verbose combat logs. Tells how close you were to success or failure.\r\n[/list]\r\n\r\n[h3]Notes[/h3]\r\nThis mod is safe to install or uninstall at any point in your run. There is an uninstall keybind that will clean up your save file but it's not strictly necessary. If you unsubscribe without using that keybind, you will get an error the next time you load your game, but the game will work perfectly fine and it will not error after that. If you wish to see the source code for this mod, you can find it on my [url=https://github.com/plaidman/qud-mods]github page[/url].\r\n\r\n[h3]Thanks[/h3]\r\n[list]\r\n[*] [b]CatlikeSpectator[/b] for the inspiration and a good starting point for this mod.\r\n[*] [b]books[/b], [b]kernel[/b], [b]Sol[/b] and other helpful and patient modders in the discord.\r\n[*] Many other devs who have shared their code through their mods, which I have referenced while making this mod.\r\n[*] Of course the Qud devs for making a great game and opened it up to modding.\r\n[/list]",
  "Tags": "Script,Arrows,Recover,Recycle",
  "Visibility": "2",
  "ImagePath": "preview.png"
}